# GetMassZoneIds Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassEnergyAnalyticalModel..::..GetMassZoneIds Method
MassEnergyAnalyticalModel Class See Also
---
Get the MassZone ElementIds that are created from this MassEnergyAnalyticalModel.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<ElementId> GetMassZoneIds()
```

Visual Basic
---
```text
Public Function GetMassZoneIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetMassZoneIds()
```

# ### Return Value
Returns the ElementIds of MassZones.
# See Also
MassEnergyAnalyticalModel Class
Autodesk.Revit.DB.Analysis Namespace